package net.yank0vy3rdna_and_Iuribabalin.Commands;

import net.yank0vy3rdna_and_Iuribabalin.App.Dispatcher;

/**
 * Команда выхода из программы
 */
public class ExitCommand implements Executable {
    @Override
    public String exec(String command, Dispatcher dispatcher) {
        dispatcher.stop();
        return "Работа в консоли закончена\n" +
                "              `..``.` ``                      \n" +
                "            `.```  `...````                   \n" +
                "          `..` `...```.``..`                  \n" +
                " ..   `. `  `:oyyy/  `...````                 \n" +
                "`sso//syo:.. .+yyy/-.  `.`````                \n" +
                " :yyysoooo+. `.--`  .```... ``                \n" +
                "  .:osssyys/-`  ..``.-`  `..``                \n" +
                "  :/yyysoosys-``.--   .``....                 \n" +
                " :ysoosssosys:--  ..`...-` `.`            ``` \n" +
                "  `.o/osso//` .-....-`  .--.           .``...`\n" +
                "       `-``-....-.  `-.```.` `..`  ````...` `.\n" +
                "       .......   ...``.`  .-..``.```..` `..`..\n" +
                "    .....-`  `.```.`  `-.```.` `...` `.``...` \n" +
                " ``....   .````.   ...` ``  ...` `.````..  ```\n" +
                "`..   `````.`   ..```.` `..`  `.``..`   .`.``.\n" +
                "` ..`````   ..```.`  .-.` `.```..   `````..  `\n" +
                ".....   `.`````  `--`  .```.-.  `.````.   ...`\n" +
                "..  ..`````   ...` `.``.--`  ..``.-`  `...`.. \n" +
                "``.....`  `..` `.` `.-`  ..``.-.  `-....-.    \n" +
                " `-.` `...``.` `...   .``..-   .--..--  .`    \n" +
                "   `.-.`..``...` `..`.-:.  `:-..--   `        \n" +
                "        `...``......-` `-.....`               ";
    }
}
